АПК/InformationRegisters/СообщенияTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СообщенияTelegram</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

АПК/Catalogs/УчетныеЗаписиTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиTelegram</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

АПК/CommonModules/МодульTelegram/Ext/Module.bsl
// Старый код:
//	РезультатЗапроса = GetUpdates(Константы.ПоследнийНомерСообщения.Получить() + 1);
//
//ЧтениеJSON = Новый ЧтениеJSON;
//ЧтениеJSON.УстановитьСтроку(РезультатЗапроса);
//СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
//ЧтениеJSON.Закрыть();
//
//Если СтруктураJSON.Свойство("ok") Тогда 
//	
//	Если СтруктураJSON.ok Тогда 
//		
//		Если СтруктураJSON.Свойство("result") Тогда 
//			
//			Для Каждого Сообщение Из СтруктураJSON.result Цикл 
//				
//				Если Сообщение.Свойство("message") Тогда 
//					
//					Если Сообщение.message.Свойство("chat") Тогда 
//						
//						НовоееСооющение = Сообщение.message.chat;
//						IDПользователяТелеграм = Формат(НовоееСооющение.id, "ЧРГ=''; ЧГ=0");
//						НайденнаяСсылка = Справочники.УчетныеЗаписиTelegram.НайтиПоРеквизиту("ID", IDПользователяТелеграм);
//						
//						Если НайденнаяСсылка = Справочники.УчетныеЗаписиTelegram.ПустаяСсылка() Тогда 
//							
//							НайденнаяСсылка = Справочники.УчетныеЗаписиTelegram.СоздатьЭлемент();
//							НайденнаяСсылка.ID = IDПользователяТелеграм;
//							НайденнаяСсылка.Наименование = НовоееСооющение.first_name;
//							НайденнаяСсылка.Записать();
//							
//						КонецЕсли;
//						
//						НоваяЗаписьРегистра = РегистрыСведений.СообщенияTelegram.СоздатьМенеджерЗаписи();
//						
//						Если Сообщение.Свойство("update_id") Тогда 
//							
//							НоваяЗаписьРегистра.IDСообщения = Сообщение.update_id;
//							Константы.ПоследнийНомерСообщения.Установить(Сообщение.update_id);
//							
//						КонецЕсли;
//						
//						НоваяЗаписьРегистра.ТекстСообщения = Сообщение.message.text;
//						НоваяЗаписьРегистра.УчетнаяЗапись  = НайденнаяСсылка;
//						НоваяЗаписьРегистра.Записать();
//						
//						SendMessage(IDПользователяТелеграм, "Бот получил ваше сообщение", СгенерироватьКлавиатуру());
//						
//					КонецЕсли;
//					
//				ИначеЕсли Не Сообщение.message.Свойство("text") Тогда 
//					
//					Если Сообщение.message.Свойство("from") Тогда 
//						SendMessage(Формат(Сообщение.message.from.id, "ЧРГ=''; ЧГ=0"), "Бот принимает только текст!");
//					КонецЕсли;			
//					
//				КонецЕсли;
//				
//			КонецЦикла;
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецЕсли;
Процедура  ЗагрузитьСообщенияИзТелеграм() Экспорт 
	
	СтруктураJSON = GetUpdates(Константы.ПоследнийНомерСообщения.Получить() + 1);
	
	Если Не СтруктураJSON.Свойство("ok") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не СтруктураJSON.ok Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не СтруктураJSON.Свойство("result") Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Сообщение Из СтруктураJSON.result Цикл
		
		Если Сообщение.Свойство("update_id") Тогда 
			Константы.ПоследнийНомерСообщения.Установить(Сообщение.update_id);
		КонецЕсли;
		
		Если Не Сообщение.Свойство("message") Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Не Сообщение.message.Свойство("text") Тогда 
			
			Если Сообщение.message.Свойство("from") Тогда 	
				SendMessage(Формат(Сообщение.message.from.id, "ЧРГ=''; ЧГ=0"), "Бот принимает только текст!");
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не Сообщение.message.Свойство("chat") Тогда 
			Продолжить;
		КонецЕсли;
		
		НовоеСообщение = Сообщение.message.chat;
		IDПользователя = Формат(НовоеСообщение.id, "ЧРГ=''; ЧГ=0");
		
		НайденнаяСсылка = Справочники.УчетныеЗаписиTelegram.НайтиПоРеквизиту("ID", IDПользователя);
		
		Если НайденнаяСсылка = Справочники.УчетныеЗаписиTelegram.ПустаяСсылка() Тогда 
			
			НайденнаяСсылка = Справочники.УчетныеЗаписиTelegram.СоздатьЭлемент();
			НайденнаяСсылка.ID = IDПользователя;
			НайденнаяСсылка.Наименование = НовоеСообщение.first_name;
			НайденнаяСсылка.Записать();
			
		КонецЕсли;
		
		НоваяЗапись				   = РегистрыСведений.СообщенияTelegram.СоздатьМенеджерЗаписи();
		НоваяЗапись.IDСообщения	   = Сообщение.update_id;
		НоваяЗапись.ТекстСообщения = Сообщение.message.text;
		НоваяЗапись.ДатаСообщения  = ТекущаяДата();
		НоваяЗапись.УчетнаяЗапись  = НайденнаяСсылка;
		
		НоваяЗапись.Записать();
		
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
		
		ТекстСообщения = СокрЛП(Сообщение.message.text);
		
		Если ТекстСообщения = "/start" Тогда 
			SendMessage(IDПользователя, "Привет! Выберите действие:", СгенерироватьКлавиатуру());
			
		ИначеЕсли ТекстСообщения = "Показать текущий баланс" Тогда
			
			Если РольДоступна("ПолныеПрава") И ТекущийПользователь <> "Добрынин Андрей Дмитриевич" Тогда
				
				SendMessage(IDПользователя, "Ваш текущий баланс карты: " + Константы.БалансКарты.Получить());
				
			Иначе 
				
				SendMessage(IDПользователя, "Вам недоступна эта информация");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция GetUpdates(offset = 0, limit = 0, timeout = 0) Экспорт 
	
	ПараметрыМетода = Новый Структура;
	
	Если ЗначениеЗаполнено(offset) Тогда 
		ПараметрыМетода.Вставить("offset", Формат(offset, "ЧРГ=''; ЧГ=0"));
	КонецЕсли;
	
	Результат = МодульWEBHTTP.ОтправитьHTTPЗапрос(Константы.TelegramТокен.Получить(), "getUpdates", ПараметрыМетода);
	Возврат Результат;
	
КонецФункции

Функция SendMessage(chat_id, text, reply_markup = Неопределено, parse_mode = Неопределено) Экспорт 
	
	ПараметрыМетода = Новый Структура;
	
	ПараметрыМетода.Вставить("chat_id", Формат(chat_id, "ЧРГ=''; ЧГ=0"));
	ПараметрыМетода.Вставить("text", СокрЛП(text));
	
	Если reply_markup <> Неопределено Тогда 
		ПараметрыМетода.Вставить("reply_markup", reply_markup);
	КонецЕсли;
	
	Если parse_mode <> Неопределено Тогда 
		ПараметрыМетода.Вставить("parse_mode", parse_mode);
	КонецЕсли;
	
	Результат = МодульWEBHTTP.ОтправитьHTTPЗапрос(Константы.TelegramТокен.Получить(), "sendMessage", ПараметрыМетода);
	Возврат Результат;
	
КонецФункции

Функция SetWebhook(url) Экспорт 
	
	ПараметрыМетода = Новый Структура;
	
	ПараметрыМетода.Вставить("url", СокрЛП(url));
	
	Результат = МодульWEBHTTP.ОтправитьHTTPЗапрос(Константы.TelegramТокен.Получить(), "setWebhook", ПараметрыМетода);
	Возврат Результат;
	
КонецФункции

Функция DeleteWebhook() Экспорт 
	
	Результат = МодульWEBHTTP.ОтправитьHTTPЗапрос(Константы.TelegramТокен.Получить(), "deleteWebhook", Неопределено);
	Возврат Результат;
	
КонецФункции

Функция GetWebhookInfo() Экспорт 
	
	ПараметрыМетода = Новый Структура;
	
	Результат = МодульWEBHTTP.ОтправитьHTTPЗапрос(Константы.TelegramТокен.Получить(), "getWebhookInfo", ПараметрыМетода);
	Возврат Результат;
	
КонецФункции

Функция SendDocument(chat_id, document, caption = Неопределено) Экспорт 
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("chat_id", Формат(chat_id, "ЧРГ=''; ЧГ=0"));
	
	Если ЗначениеЗаполнено(caption) Тогда 
		ПараметрыМетода.Вставить("caption", caption);
	КонецЕсли;
		
	Результат = МодульWEBHTTP.ОтправитьHTTPЗапрос(Константы.TelegramТокен.Получить(), "sendDocument", ПараметрыМетода);
	Возврат Результат;
	
КонецФункции

Функция СгенерироватьКлавиатуру() Экспорт 
	
	СтрокаКнопок_1 = Новый Массив;
	СтрокаКнопок_1.Добавить("Показать текущий баланс");
	
	Клавиатура = Новый Массив;
	Клавиатура.Добавить(СтрокаКнопок_1);
	
	РезультатКлавиатуры = Новый Структура;
	РезультатКлавиатуры.Вставить("keyboard", Клавиатура);
	РезультатКлавиатуры.Вставить("resize_keyboard", Истина);
	РезультатКлавиатуры.Вставить("one_time_keyboard", Ложь);
	
	Возврат РезультатКлавиатуры;
	
КонецФункции

Процедура ОбработатьВходящееСообщение(Сообщение) Экспорт 
	
	Если Не Сообщение.Свойство("message") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Сообщение.message.Свойство("text") Тогда 
		
		Если Сообщение.message.Свойство("from") Тогда 
			SendMessage(Формат(Сообщение.message.from.id, "ЧРГ=''; ЧГ=0"), "Бот принимает только текст!");	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если Не Сообщение.message.Свойство("chat") Тогда 
		Возврат;
	КонецЕсли;
	
	IDПользователя  = Формат(Сообщение.message.from.id, "ЧРГ=''; ЧГ=0");
	НайденнаяСсылка = Справочники.УчетныеЗаписиTelegram.НайтиПоРеквизиту("ID", IDПользователя);
	
	Если НайденнаяСсылка = Справочники.УчетныеЗаписиTelegram.ПустаяСсылка() Тогда 
		
		НайденнаяСсылка				 = Справочники.УчетныеЗаписиTelegram.СоздатьЭлемент();
		НайденнаяСсылка.ID			 = IDПользователя;
		НайденнаяСсылка.Наименование = Сообщение.message.chat.first_name;
		
		НайденнаяСсылка.Записать();
		
	КонецЕсли;
	
	НоваяЗапись				   = РегистрыСведений.СообщенияTelegram.СоздатьМенеджерЗаписи();
	НоваяЗапись.IDСообщения	   = Сообщение.update_id;
	НоваяЗапись.ТекстСообщения = Сообщение.message.text;
	НоваяЗапись.УчетнаяЗапись  = НайденнаяСсылка;
	НоваяЗапись.ДатаСообщения  = ТекущаяДата();
	
	НоваяЗапись.Записать();
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	ТекстСообщения = СокрЛП(Сообщение.message.text);
	
	Если ТекстСообщения = "/start" Тогда 
		
		SendMessage(IDПользователя, "Привет! Выберите действие:", СгенерироватьКлавиатуру());
		
	ИначеЕсли ТекстСообщения = "Показать текущий баланс" Тогда
		
		Если РольДоступна("ПолныеПрава") И Не ТекущийПользователь = "Добрынин Андрей Дмитриевич" Тогда 
		
			SendMessage(IDПользователя, "Ваш текущий баланс карты: " + Константы.БалансКарты.Получить());
			
		Иначе 
			
			SendMessage(IDПользователя, "У вас недостадочно прав для просмотра этой информации!");
			
		КонецЕсли;
		
	Иначе 
		
		SendMessage(IDПользователя, "Неизвестная команда. Выберите действие:", СгенерироватьКлавиатуру()); 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УведомитьИнициатораОЗавершении(БизнесПроцесс) Экспорт
    
    ИнициаторСозвона = СокрЛП(ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя);
    Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ИнициаторСозвона);
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	УчетныеЗаписиTelegram.ID КАК ID
    |ИЗ
    |	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
    |ГДЕ
    |	ВЫРАЗИТЬ(УчетныеЗаписиTelegram.Сотрудник КАК Справочник.Сотрудники) = &Сотрудник
    |	И НЕ УчетныеЗаписиTelegram.ПометкаУдаления";
    Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
    
    Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Уведомление = "Здравствуйте, " + СокрЛП(ИнициаторСозвона) + "!"
		+ Символы.ПС + "Уведомляю вас, что все сотруднки были оповещены о созвоне!";
		
		SendMessage(Выборка.ID, Уведомление);

    КонецЕсли;
    
КонецПроцедуры
